mui.init();
var type = 1;

var titleMapper = {
   '1': '西北电网新能源消纳计算分析',
   '2': '甘肃电网新能源消纳计算分析',
   '3': '新疆电网新能源消纳计算分析',
   '4': '宁夏电网新能源消纳计算分析',
   '5': '青海电网新能源消纳计算分析',
   '6': '陕北电网新能源消纳计算分析',
   '7': '东北电网新能源消纳计算分析'
};

var dataMapper = {
   '1': {
      'comments': '外送中长期高峰时段均为08:00-20:00，外送现货不调峰运行',
      'data': [{
            "date": "2020",
            "最大负荷": 10500,
            "负荷率": "92%",
            "正备用率": "5%",
            "调峰率": "40%",
            "自备电厂比例": "15%",
            "新能源装机": 11000,
            "风电占比": "53%",
            "光伏占比": "47%",
            "外送中长期(高峰)": "3200万",
            "外送中长期(低谷)": "2240万",
            "外送现货": "450",
            "弃电率": "9.84%",
            "新能源发电量占发电量比例": "15.76%"
         }, {
            "date": "2019",
            "最大负荷": 9600,
            "负荷率": "92%",
            "正备用率": "5%",
            "调峰率": "40%",
            "自备电厂比例": "15%",
            "新能源装机": 10000,
            "风电占比": "55%",
            "光伏占比": "45%",
            "外送中长期(高峰)": "2600万",
            "外送中长期(低谷)": "1820万",
            "外送现货": "350",
            "弃电率": "11.32%",
            "新能源发电量占发电量比例": "15.89%"
         }, {
            "date": "2018",
            "最大负荷": 8800,
            "负荷率": "92%",
            "正备用率": "5%",
            "调峰率": "40%",
            "自备电厂比例": "15%",
            "新能源装机": 9000,
            "风电占比": "56%",
            "光伏占比": "44%",
            "外送中长期(高峰)": "2000万",
            "外送中长期(低谷)": "1400万",
            "外送现货": "260",
            "弃电率": "12.55%",
            "新能源发电量占发电量比例": "15.96%"
         }, {
            "date": "2017",
            "最大负荷": 7600,
            "负荷率": "92%",
            "正备用率": "5%",
            "调峰率": "40%",
            "自备电厂比例": "15%",
            "新能源装机": 8104,
            "风电占比": "57%",
            "光伏占比": "43%",
            "外送中长期(高峰)": "1400万",
            "外送中长期(低谷)": "980万",
            "外送现货": "200",
            "弃电率": "15.66%",
            "新能源发电量占发电量比例": "16.63%"
         }, {
            "date": "2017.5",
            "最大负荷": 6826,
            "负荷率": "92%",
            "正备用率": "5%",
            "调峰率": "40%",
            "自备电厂比例": "15%",
            "新能源装机": 7479,
            "风电占比": "59%",
            "光伏占比": "41%",
            "外送中长期(高峰)": "1200万",
            "外送中长期(低谷)": "840万",
            "外送现货": "200",
            "弃电率": "16.86%",
            "新能源发电量占发电量比例": "17.02%"
         },
         {
            'date': '2017.4',
            '最大负荷': 6984,
            '负荷率': '92%',
            '正备用率': '5%',
            '调峰率': '40%',
            '自备电厂比例': '15%',
            '新能源装机': 7477,
            '风电占比': '59%',
            '光伏占比': '41%',
            '外送中长期(高峰)': '1100万',
            '外送中长期(低谷)': '770万',
            '外送现货': '200',
            '弃电率': '16.50%',
            '新能源发电量占发电量比例': '16.95%'
         },
         {
            'date': '2017.3',
            '最大负荷': 7178,
            '负荷率': '92%',
            '正备用率': '5%',
            '调峰率': '40%',
            '自备电厂比例': '15%',
            '新能源装机': 7467,
            '风电占比': '59%',
            '光伏占比': '41%',
            '外送中长期(高峰)': '1250万',
            '外送中长期(低谷)': '875万',
            '外送现货': '200',
            '弃电率': '15.14%',
            '新能源发电量占发电量比例': '16.54%'
         },
         {
            'date': '2017.2',
            '最大负荷': 6980,
            '负荷率': '92%',
            '正备用率': '5%',
            '调峰率': '40%',
            '自备电厂比例': '15%',
            '新能源装机': 7446,
            '风电占比': '59%',
            '光伏占比': '41%',
            '外送中长期(高峰)': '1150万',
            '外送中长期(低谷)': '805万',
            '外送现货': '100',
            '弃电率': '18.30%',
            '新能源发电量占发电量比例': '16.50%'
         },
         {
            'date': '2017.1',
            '最大负荷': 7365,
            '负荷率': '92%',
            '正备用率': '5%',
            '调峰率': '40%',
            '自备电厂比例': '15%',
            '新能源装机': 7422,
            '风电占比': '59%',
            '光伏占比': '41%',
            '外送中长期(高峰)': '1280万',
            '外送中长期(低谷)': '896万',
            '外送现货': '0',
            '弃电率': '18.07%',
            '新能源发电量占发电量比例': '15.60%'
         },
         {
            'date': '2016',
            '最大负荷': 7200,
            '负荷率': '90%',
            '正备用率': '5%',
            '调峰率': '40%',
            '自备电厂比例': '15%',
            '新能源装机': 7366,
            '风电占比': '59%',
            '光伏占比': '41%',
            '外送中长期(高峰)': '980万',
            '外送中长期(低谷)': '686万',
            '外送现货': '0',
            '弃电率': '24.03%',
            '新能源发电量占发电量比例': '15.43%'
         },
         {
            'date': '2015',
            '最大负荷': 6800,
            '负荷率': '90%',
            '正备用率': '5%',
            '调峰率': '40%',
            '自备电厂比例': '15%',
            '新能源装机': 5618,
            '风电占比': '65%',
            '光伏占比': '35%',
            '外送中长期(高峰)': '780万',
            '外送中长期(低谷)': '546万',
            '外送现货': '0',
            '弃电率': '18.21%',
            '新能源发电量占发电量比例': '13.88%'
         }
      ]
   },
   '2': {
      'comments': '外送高峰时段均为08:00-20:00，外送现货0:00-24:00',
      data: [{
            'date': '2017.5',
            '最大负荷': 1150,
            '新能源装机': 1957,
            '风电占比': '65%',
            '光伏占比': '35%',
            '负荷率': '92%',
            '正备用率': '-10%',
            '调峰率': '30%',
            '自备电厂比例': '10%',
            '外送中长期(高峰)': '160万',
            '外送中长期(低谷)': '112万',
            '外送现货': '150万',
            '新能源弃电率': '19.90%',
            '新能源发电量占总发电量比例': '25.50%'
         },
         {
            'date': '2017.4',
            '最大负荷': 1140,
            '新能源装机': 1957,
            '风电占比': '65%',
            '光伏占比': '35%',
            '负荷率': '92%',
            '正备用率': '-10%',
            '调峰率': '30%',
            '自备电厂比例': '10%',
            '外送中长期(高峰)': '200万',
            '外送中长期(低谷)': '140万',
            '外送现货': '100万',
            '新能源弃电率': '23.92%',
            '新能源发电量占总发电量比例': '24.11%'
         },
         {
            'date': '2017.3',
            '最大负荷': 1194,
            '新能源装机': 1957,
            '风电占比': '65%',
            '光伏占比': '35%',
            '负荷率': '92%',
            '正备用率': '-10%',
            '调峰率': '30%',
            '自备电厂比例': '10%',
            '外送中长期(高峰)': '250万',
            '外送中长期(低谷)': '175万',
            '外送现货': '100万',
            '新能源弃电率': '21.63%',
            '新能源发电量占总发电量比例': '23.20%'
         },
         {
            'date': '2017.2',
            '最大负荷': 1182,
            '新能源装机': 1957,
            '风电占比': '65%',
            '光伏占比': '35%',
            '负荷率': '92%',
            '正备用率': '-10%',
            '调峰率': '30%',
            '自备电厂比例': '10%',
            '外送中长期(高峰)': '200万',
            '外送中长期(低谷)': '140万',
            '外送现货': '100万',
            '新能源弃电率': '22.87%',
            '新能源发电量占总发电量比例': '23.74%'
         },
         {
            'date': '2017.1',
            '最大负荷': 1248,
            '新能源装机': 1957,
            '风电占比': '65%',
            '光伏占比': '35%',
            '负荷率': '92%',
            '正备用率': '-10%',
            '调峰率': '30%',
            '自备电厂比例': '10%',
            '外送中长期(高峰)': '230万',
            '外送中长期(低谷)': '161万',
            '外送现货': '30万',
            '新能源弃电率': '27.64%',
            '新能源发电量占总发电量比例': '21.36%'
         },
         {
            'date': '2016',
            '最大负荷': 1339,
            '新能源装机': 1957,
            '风电占比': '65%',
            '光伏占比': '35%',
            '负荷率': '92%',
            '正备用率': '-5%',
            '调峰率': '30%',
            '自备电厂比例': '10%',
            '外送中长期(高峰)': '190万',
            '外送中长期(低谷)': '133万',
            '外送现货': '0',
            '新能源弃电率': '36.27%',
            '新能源发电量占总发电量比例': '18.33%'
         },
         {
            'date': '2015',
            '最大负荷': 1303,
            '新能源装机': 1820,
            '风电占比': '66%',
            '光伏占比': '34%',
            '负荷率': '92%',
            '正备用率': '-5%',
            '调峰率': '30%',
            '自备电厂比例': '10%',
            '外送中长期(高峰)': '180万',
            '外送中长期(低谷)': '126万',
            '外送现货': '0',
            '新能源弃电率': '34.54%',
            '新能源发电量占总发电量比例': '18.10%'
         }
      ]
   },
   '3': {
      'comments': '外送高峰时段均为08:00-20:00，外送现货0:00-24:00',
      data: [{
            'date': '2017.5',
            '最大负荷': 2450,
            '新能源装机': 2789,
            '风电占比': '68%',
            '光伏占比': '32%',
            '负荷率': '95%',
            '正备用率': '-5%',
            '调峰率': '45%',
            '自备电厂比例': '50%',
            '外送中长期(高峰)': '580万',
            '外送中长期(低谷)': '464万',
            '外送现货': '100万',
            '新能源弃电率': '18.92%',
            '新能源发电量占总发电量比例': '16.18%'
         },
         {
            'date': '2017.4',
            '最大负荷': 2548,
            '新能源装机': 2789,
            '风电占比': '68%',
            '光伏占比': '32%',
            '负荷率': '95%',
            '正备用率': '-5%',
            '调峰率': '45%',
            '自备电厂比例': '50%',
            '外送中长期(高峰)': '480万',
            '外送中长期(低谷)': '432万',
            '外送现货': '50万',
            '新能源弃电率': '20.22%',
            '新能源发电量占总发电量比例': '15.87%'
         },
         {
            'date': '2017.3',
            '最大负荷': 2561,
            '新能源装机': 2789,
            '风电占比': '68%',
            '光伏占比': '32%',
            '负荷率': '95%',
            '正备用率': '-5%',
            '调峰率': '40%',
            '自备电厂比例': '50%',
            '外送中长期(高峰)': '580万',
            '外送中长期(低谷)': '464万',
            '外送现货': '50万',
            '新能源弃电率': '25.04%',
            '新能源发电量占总发电量比例': '14.50%'
         },
         {
            'date': '2017.2',
            '最大负荷': 2425,
            '新能源装机': 2789,
            '风电占比': '68%',
            '光伏占比': '32%',
            '负荷率': '95%',
            '正备用率': '-2%',
            '调峰率': '40',
            '自备电厂比例': '50%',
            '外送中长期(高峰)': '540万',
            '外送中长期(低谷)': '432万',
            '外送现货': '50万',
            '新能源弃电率': '32.84%',
            '新能源发电量占总发电量比例': '13.73%'
         },
         {
            'date': '2017.1',
            '最大负荷': 2538,
            '新能源装机': 2784,
            '风电占比': '68%',
            '光伏占比': '32%',
            '负荷率': '95%',
            '正备用率': '-2%',
            '调峰率': '40%',
            '自备电厂比例': '50%',
            '外送中长期(高峰)': '580万',
            '外送中长期(低谷)': '464万',
            '外送现货': '30万',
            '新能源弃电率': '32.48%',
            '新能源发电量占总发电量比例': '13.16%'
         },
         {
            'date': '2016',
            '最大负荷': 2603,
            '新能源装机': 2777,
            '风电占比': '68%',
            '光伏占比': '32%',
            '负荷率': '95%',
            '正备用率': '-2%',
            '调峰率': '45%',
            '自备电厂比例': '50%',
            '外送中长期(高峰)': '480万',
            '外送中长期(低谷)': '336万',
            '外送现货': '0',
            '新能源弃电率': '30.64%',
            '新能源发电量占总发电量比例': '13.80%'
         },
         {
            'date': '2015',
            '最大负荷': 2573,
            '新能源装机': 2067,
            '风电占比': '75%',
            '光伏占比': '25%',
            '负荷率': '95%',
            '正备用率': '-2%',
            '调峰率': '45%',
            '自备电厂比例': '50%',
            '外送中长期(高峰)': '380万',
            '外送中长期(低谷)': '266万',
            '外送现货': '0',
            '新能源弃电率': '22.51%',
            '新能源发电量占总发电量比例': '12.15%'
         }
      ]
   },
   '4': {
      'comments': '外送高峰时段均为08:00-20:00，外送现货0:00-24:00',
      data: [{
            'date': '2017.5',
            '最大负荷': 1075,
            '新能源装机': 1447,
            '风电占比': '65%',
            '光伏占比': '35%',
            '负荷率': '95%',
            '正备用率': '-5%',
            '调峰率': '50%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '470万',
            '外送中长期(低谷)': '329万',
            '外送现货': '50万',
            '新能源弃电率': '1.11%',
            '新能源发电量占总发电量比例': '20.58%'
         },
         {
            'date': '2017.4',
            '最大负荷': 1065,
            '新能源装机': 1447,
            '风电占比': '65%',
            '光伏占比': '35%',
            '负荷率': '95%',
            '正备用率': '-5%',
            '调峰率': '50%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '470万',
            '外送中长期(低谷)': '329万',
            '外送现货': '50万',
            '新能源弃电率': '1.17%',
            '新能源发电量占总发电量比例': '20.71%'
         },
         {
            'date': '2017.3',
            '最大负荷': 1062,
            '新能源装机': 1447,
            '风电占比': '65%',
            '光伏占比': '35%',
            '负荷率': '95%',
            '正备用率': '10%',
            '调峰率': '50%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '470万',
            '外送中长期(低谷)': '329万',
            '外送现货': '60万',
            '新能源弃电率': '3.15%',
            '新能源发电量占总发电量比例': '20.29%'
         },
         {
            'date': '2017.2',
            '最大负荷': 1019,
            '新能源装机': 1447,
            '风电占比': '65%',
            '光伏占比': '35%',
            '负荷率': '95%',
            '正备用率': '10%',
            '调峰率': '45%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '410万',
            '外送中长期(低谷)': '301万',
            '外送现货': '50万',
            '新能源弃电率': '7.62%',
            '新能源发电量占总发电量比例': '20.54%'
         },
         {
            'date': '2017.1',
            '最大负荷': 1072,
            '新能源装机': 1447,
            '风电占比': '65%',
            '光伏占比': '35%',
            '负荷率': '95%',
            '正备用率': '10%',
            '调峰率': '45%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '430万',
            '外送中长期(低谷)': '301万',
            '外送现货': '60万',
            '新能源弃电率': '6.34%',
            '新能源发电量占总发电量比例': '19.91%'
         },
         {
            'date': '2016',
            '最大负荷': 1152,
            '新能源装机': 1338,
            '风电占比': '63%',
            '光伏占比': '37%',
            '负荷率': '95%',
            '正备用率': '10%',
            '调峰率': '40%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '390万',
            '外送中长期(低谷)': '273万',
            '外送现货': '15万',
            '新能源弃电率': '10.52%',
            '新能源发电量占总发电量比例': '17.12%'
         },
         {
            'date': '2015',
            '最大负荷': 1108,
            '新能源装机': 1128,
            '风电占比': '73%',
            '光伏占比': '27%',
            '负荷率': '95%',
            '正备用率': '10%',
            '调峰率': '40%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '370万',
            '外送中长期(低谷)': '290万',
            '外送现货': '10万',
            '新能源弃电率': '8.46%',
            '新能源发电量占总发电量比例': '15.59%'
         }
      ]
   },
   '5': {
      'comments': '外送高峰时段均为08:00-20:00，外送现货0:00-24:00',
      data: [{
            'date': '2017.5',
            '最大负荷': 800,
            '新能源装机': 783,
            '风电占比': '9%',
            '光伏占比': '91%',
            '负荷率': '97%',
            '正备用率': '80%',
            '调峰率': '85%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '-70万',
            '外送中长期(低谷)': '-49万',
            '外送现货': '0万',
            '新能源弃电率': '0.48%',
            '新能源发电量占总发电量比例': '19.41%'
         },
         {
            'date': '2017.4',
            '最大负荷': 840,
            '新能源装机': 783,
            '风电占比': '9%',
            '光伏占比': '91%',
            '负荷率': '97%',
            '正备用率': '80%',
            '调峰率': '85%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '-100万',
            '外送中长期(低谷)': '-70万',
            '外送现货': '0万',
            '新能源弃电率': '0.41%',
            '新能源发电量占总发电量比例': '19.19%'
         },
         {
            'date': '2017.3',
            '最大负荷': 810,
            '新能源装机': 783,
            '风电占比': '9%',
            '光伏占比': '91%',
            '负荷率': '97%',
            '正备用率': '80%',
            '调峰率': '82%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '-110万',
            '外送中长期(低谷)': '-77万',
            '外送现货': '0万',
            '新能源弃电率': '3.15%',
            '新能源发电量占总发电量比例': '19.74%'
         },
         {
            'date': '2017.2',
            '最大负荷': 770,
            '新能源装机': 783,
            '风电占比': '9%',
            '光伏占比': '91%',
            '负荷率': '97%',
            '正备用率': '80%',
            '调峰率': '80%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '-110万',
            '外送中长期(低谷)': '-77万',
            '外送现货': '0万',
            '新能源弃电率': '7.27',
            '新能源发电量占总发电量比例': '20.05%'
         },
         {
            'date': '2017.1',
            '最大负荷': 857,
            '新能源装机': 783,
            '风电占比': '9%',
            '光伏占比': '91%',
            '负荷率': '97%',
            '正备用率': '80%',
            '调峰率': '80%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '-230万',
            '外送中长期(低谷)': '-161万',
            '外送现货': '0万',
            '新能源弃电率': '11.14%',
            '新能源发电量占总发电量比例': '20.35%'
         },
         {
            'date': '2016',
            '最大负荷': 858,
            '新能源装机': 748,
            '风电占比': '9%',
            '光伏占比': '91%',
            '负荷率': '97%',
            '正备用率': '80%',
            '调峰率': '80%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '-120万',
            '外送中长期(低谷)': '-84万',
            '外送现货': '0万',
            '新能源弃电率': '2.17%',
            '新能源发电量占总发电量比例': '18.07%'
         },
         {
            'date': '2015',
            '最大负荷': 838,
            '新能源装机': 604,
            '风电占比': '9%',
            '光伏占比': '91%',
            '负荷率': '97%',
            '正备用率': '80%',
            '调峰率': '85%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '-110万',
            '外送中长期(低谷)': '-77万',
            '外送现货': '0万',
            '新能源弃电率': '0.00%',
            '新能源发电量占总发电量比例': '15.11%'
         }
      ]
   },
   '6': {
      'comments': '外送高峰时段均为08:00-20:00，外送现货0:00-24:00',
      data: [{
            'date': '2017.5',
            '最大负荷': 241,
            '新能源装机': 382,
            '风电占比': '44%',
            '光伏占比': '56%',
            '负荷率': '70%',
            '正备用率': '-35%',
            '调峰率': '50%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '180万',
            '外送中长期(低谷)': '126',
            '外送现货': '0万',
            '新能源弃电率': '1.33%',
            '新能源发电量占总发电量比例': '22.69%'
         },
         {
            'date': '2017.4',
            '最大负荷': 244,
            '新能源装机': 375,
            '风电占比': '44%',
            '光伏占比': '56%',
            '负荷率': '70%',
            '正备用率': '-35%',
            '调峰率': '50%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '120万',
            '外送中长期(低谷)': '84万',
            '外送现货': '0万',
            '新能源弃电率': '3.84%',
            '新能源发电量占总发电量比例': '25.61%'
         },
         {
            'date': '2017.3',
            '最大负荷': 250,
            '新能源装机': 370,
            '风电占比': '44%',
            '光伏占比': '56%',
            '负荷率': '70%',
            '正备用率': '-20%',
            '调峰率': '50%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '120万',
            '外送中长期(低谷)': '84万',
            '外送现货': '0万',
            '新能源弃电率': '9.12%',
            '新能源发电量占总发电量比例': '23.52%'
         },
         {
            'date': '2017.2',
            '最大负荷': 240,
            '新能源装机': 360,
            '风电占比': '44%',
            '光伏占比': '56%',
            '负荷率': '70%',
            '正备用率': '-20%',
            '调峰率': '50%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '120万',
            '外送中长期(低谷)': '84万',
            '外送现货': '0万',
            '新能源弃电率': '8.84%',
            '新能源发电量占总发电量比例': '23.55%'
         },
         {
            'date': '2017.1',
            '最大负荷': 259,
            '新能源装机': 334,
            '风电占比': '43%',
            '光伏占比': '57%',
            '负荷率': '70%',
            '正备用率': '-20%',
            '调峰率': '50%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '120万',
            '外送中长期(低谷)': '84万',
            '外送现货': '0万',
            '新能源弃电率': '6.96',
            '新能源发电量占总发电量比例': '21.20%'
         },
         {
            'date': '2016',
            '最大负荷': 267,
            '新能源装机': 334,
            '风电占比': '43%',
            '光伏占比': '54%',
            '负荷率': '70%',
            '正备用率': '-20%',
            '调峰率': '50%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '120万',
            '外送中长期(低谷)': '84万',
            '外送现货': '0万',
            '新能源弃电率': '6.86',
            '新能源发电量占总发电量比例': '20.81%'
         },
         {
            'date': '2015',
            '最大负荷': 220,
            '新能源装机': 129,
            '风电占比': '68%',
            '光伏占比': '32%',
            '负荷率': '70%',
            '正备用率': '-35%',
            '调峰率': '50%',
            '自备电厂比例': '0%',
            '外送中长期(高峰)': '120万',
            '外送中长期(低谷)': '84万',
            '外送现货': '0万',
            '新能源弃电率': '0.37%',
            '新能源发电量占总发电量比例': '10.35%'
         }
      ]
   },
   '7': {
      'comments': '外送高峰时段均为08:00-20:00，外送现货0:00-24:00',
      data: [{
         'date': '2016',
         '最大负荷': 5200,
         '新能源装机': 2822,
         '风电占比': '92%',
         '光伏占比': '8%',
         '负荷率': '90%',
         '正备用率': '10%',
         '调峰率': '40%',
         '自备电厂比例': '5%',
         '外送中长期(高峰)': '240万',
         '外送中长期(低谷)': '168万',
         '外送现货': '0万',
         '新能源弃电率': '14.08%',
         '新能源发电量占总发电量比例': '10.87%'
      }]
   }
};

var liTmpl = '<li class="mui-table-view-cell mui-collapse data-item">' +
   '<a class="mui-navigate-right" href="#">{title}</a>' +
   '<div class="mui-collapse-content">' +
   '<ul class="item-container">' +
   '{content}' +
   '<li class="mui-table-view-cell"><button class="calc-btn">弃电率计算</button></li>' +
   '</ul>' +
   '</div>' +
   '</li>';

var itemTmpl = '<li class="mui-table-view-cell value-item">' +
   '<span class="title-text">{title}</span>' +
   '<span class="value-text">{value}</span>' +
   '</li>';

var render = function() {
   var data = dataMapper[type];
   var html = '';
   var comments = data['comments'];

   $.each(data['data'], function(idx, d) {
      var title = d['date'];
      var content = '';
      var idata = d;

      for(var ikey in idata) {
         if(ikey == 'date') {
            continue;
         }

         content += itemTmpl.replace(/{title}/, ikey)
            .replace(/{value}/, idata[ikey]);
      }

      html += liTmpl.replace(/{title}/, title)
         .replace(/{content}/, content);
   });

   $('#ulContainer').html(html);
   // $('#comments').html(comments);

   var $collapse = $('#ulContainer .mui-collapse');

   if($collapse.length == 1) {
      $collapse.addClass('mui-active');
   }
};

$("#ulContainer").delegate(".calc-btn", "tap", function() {
   var content = $(this).closest(".data-item");
   var dateStr = $(content).find(".mui-navigate-right").html();
   var data = dataMapper[type]['data'];

   for(var i = 0; i < data.length; i++) {
      var d = data[i];

      if(d['date'] == dateStr) {
         data = d;
         break;
      }
   }

   var launchView = plus.webview.getLaunchWebview();
   var isMonth = dateStr.indexOf(".") >= 0;
   var sdate = moment('2016.01.01', 'YYYY.MM.DD').startOf('year');
   var edate = moment('2016.01.01', 'YYYY.MM.DD').endOf('year');;

   if(isMonth) {
      sdate = moment(dateStr + ".01", "YYYY.MM.DD").startOf('month');
      edate = moment(dateStr + ".01", "YYYY.MM.DD").endOf('month');
   } else if(dateStr != '东北' && dateStr != '华北') {
      sdate = moment(dateStr + ".01.01", "YYYY.MM.DD").startOf('year');
      edate = moment(dateStr + ".01.01", "YYYY.MM.DD").endOf('year');
   }

   var zlxhValue = Number(data['外送现货'].replace(/万/, '')) * 10;
   var zlgffhValue = Number(data['外送中长期(高峰)'].replace(/万/, '')) * 10;

   var value = {
      type: 1,
      sdate: sdate,
      edate: edate,
      zdfhValue: Number(data['最大负荷']) * 10,
      fhlValue: Number(data['负荷率'].replace(/%/, '')) * 0.01,
      sbyxsValue: Number(data['正备用率'].replace(/%/, '')) * 0.01,
      hdtflValue: Number(data['调峰率'].replace(/%/, '')) * 0.01,
      zbdcblValue: Number(data['自备电厂比例'].replace(/%/, '')) * 0.01,
      xnyzjValue: Number(data['新能源装机']) * 10,
      fdzjbValue: Number(data['风电占比'].replace(/%/, '')) * 0.01,
      zlssnlValue: zlgffhValue + zlxhValue,
      zlgffhValue: zlgffhValue,
      zlpdfhValue: Number(data['外送中长期(低谷)'].replace(/万/, '')) * 10,
      zlxhValue: zlxhValue,
   };

   mui.fire(launchView, 'POPULATE_DATA', {
      inputs: value
   });
});

mui.plusReady(function() {
   type = plus.webview.currentWebview().type;
   $('#titleText').html(titleMapper[type]);

   render();
});